Revit 2024 API
DuctSettings.SetSpecificFittingAngleStatus Method
 Sets the status of given specific angle.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public void SetSpecificFittingAngleStatus(
	double angle,
	bool useInLayout
)
Visual Basic
Public Sub SetSpecificFittingAngleStatus ( _
	angle As Double, _
	useInLayout As Boolean _
)
Visual C++
public:
void SetSpecificFittingAngleStatus(
	double angle,
	bool useInLayout
)
Parameters
angle
Type: System.Double
 The specific angle (in degree) that must be one of 60, 45, 30, 22.5 or 11.25 degrees.
useInLayout
Type: System.Boolean
 Status, true - using the given angle during the duct layout.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  The given value for angle must be 90, 60, 45, 30, 22.5 or 11.25 degrees.
Autodesk.Revit.Exceptions.InvalidOperationException |  Can not set an angle status for an invalid angle.
See Also
DuctSettings Class
Autodesk.Revit.DB.Mechanical Namespace